_posts/2021-12-20-abc232-d.html
---
title: D - Weak Takhashi
tags: AtCoder Graph
---

<div id="outline-container-org21ac6da" class="outline-2">
<h2 id="org21ac6da"><span class="todo TODO">TODO</span> D - Weak Takahashi</h2>
<div class="outline-text-2" id="text-org21ac6da">
<ul class="org-ul">
<li>HxW 크기의 배열에 .빈공간과 #막힌곳이 있을때, 1,1에서 얼마나 많이 움직일 수 있는지 세기</li>
</ul>
</div>
</div>
<div id="outline-container-org177eb1b" class="outline-2">
<h2 id="org177eb1b">접근하기</h2>
<div class="outline-text-2" id="text-org177eb1b">
<ul class="org-ul">
<li>BFS를 이용해서 풀이함</li>
<li>dp style의 bottom up으로 풀이 가능할 것</li>
</ul>
</div>
</div>
<div id="outline-container-orgc1f2c9b" class="outline-2">
<h2 id="orgc1f2c9b">코드1 - BFS</h2>
<div class="outline-text-2" id="text-orgc1f2c9b">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;queue&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;vector&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">H</span>, <span style="color: #ff6347;">W</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">map</span>[110][110];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">visit</span>[110][110];

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span> {
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">y</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">x</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">len</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">safe</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">y</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">x</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> (0&lt;=x &amp;&amp; x&lt;W) &amp;&amp; (0&lt;=y &amp;&amp; y&lt;H);
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;H, &amp;W);
    <span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">str</span>[110];
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;H;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%s"</span>, str);        

        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=0;str[j];j++) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (str[j] == <span style="color: #ad7fa8; font-style: italic;">'.'</span>) {
                <span style="color: #8ae234; font-weight: bold;">map</span>[i][j] = 0;
            } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (str[j] == <span style="color: #ad7fa8; font-style: italic;">'#'</span>) { 
                <span style="color: #8ae234; font-weight: bold;">map</span>[i][j] = 1;
            }
        }
    }

    <span style="color: #8ae234; font-weight: bold;">queue</span>&lt;<span style="color: #8ae234; font-weight: bold;">Node</span>&gt; <span style="color: #ff6347;">q</span>;
    q.push({0, 0, 1}); 
    visit[0][0] = 1;

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ans</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">while</span>(!q.empty()) {
        <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">cur</span> = q.front(); q.pop();
        ans = cur.len;
        <span style="color: #729fcf; font-weight: bold;">if</span> (safe(cur.y, cur.x + 1) &amp;&amp; map[cur.y][cur.x + 1] == 0 &amp;&amp; visit[cur.y][cur.x + 1] == 0) {
            visit[cur.y][cur.x + 1] = 1;
            q.push({cur.y, cur.x + 1, cur.len+1});
        }

        <span style="color: #729fcf; font-weight: bold;">if</span> (safe(cur.y+1, cur.x) &amp;&amp; map[cur.y + 1][cur.x] == 0 &amp;&amp; visit[cur.y + 1][cur.x] == 0) {
            visit[cur.y + 1][cur.x] = 1; 
            q.push({cur.y+1, cur.x, cur.len+1});
        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, ans);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org946deef" class="outline-2">
<h2 id="org946deef"><span class="todo TODO">TODO</span> 코드2 - DP style?</h2>
</div>

<div id="outline-container-org38ed8af" class="outline-2">
<h2 id="org38ed8af">문제 링크</h2>
<div class="outline-text-2" id="text-org38ed8af">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc232/tasks/abc232_d">https://atcoder.jp/contests/abc232/tasks/abc232_d</a></li>
</ul>
</div>
</div>
